michaelng1129/ArduinoCore-GD32V/boards.txt
# Arduino boards.txt for GD32VW55x - English comments
# Structure: cores/arduino/ + system/gd32vw55x/ + variants/ (2 variants for pin mapping)
# Flash size is a menu, like ESP32 does for 4M/8M/16M - not separate variants

# ------------------------------------------------------------
# Menu definition for Flash Size - similar to ESP32
# ------------------------------------------------------------
menu.flash=Flash Size
menu.flash.4m=4M (Default)
menu.flash.4m.build.flash_size=4194304
menu.flash.2m=2M
menu.flash.2m.build.flash_size=2097152

# ------------------------------------------------------------
# GD32VW553K-START - QFN32, 21 GPIOs - K version
# ------------------------------------------------------------
gd32vw553k_start.name=GD32VW553K-START
gd32vw553k_start.vid.0=0x28E9
gd32vw553k_start.pid.0=0x0189

gd32vw553k_start.build.mcu=gd32vw55x
gd32vw553k_start.build.f_cpu=160000000L
gd32vw553k_start.build.board=GD32VW553K_START
gd32vw553k_start.build.core=arduino
gd32vw553k_start.build.variant=gd32vw553k_start
gd32vw553k_start.build.system.path=system/gd32vw55x
gd32vw553k_start.build.extra_flags=-DGD32VW553K_START -DBOARD_START -DUSE_STDPERIPH_DRIVER
gd32vw553k_start.build.ldscript=ldscript.ld
gd32vw553k_start.upload.tool=openocd
gd32vw553k_start.upload.maximum_size=4194304
gd32vw553k_start.upload.maximum_data_size=294912

# Flash menu for K-START
gd32vw553k_start.menu.flash.4m.build.extra_flags=-DFLASH_4M
gd32vw553k_start.menu.flash.4m.build.ldscript=ldscript.ld
gd32vw553k_start.menu.flash.4m.upload.maximum_size=4194304

gd32vw553k_start.menu.flash.2m.build.extra_flags=-DFLASH_2M
gd32vw553k_start.menu.flash.2m.build.ldscript=ldscript_2m.ld
gd32vw553k_start.menu.flash.2m.upload.maximum_size=2097152

# ------------------------------------------------------------
# GD32VW553H-START - QFN40, 28 GPIOs - H version
# ------------------------------------------------------------
gd32vw553h_start.name=GD32VW553H-START
gd32vw553h_start.vid.0=0x28E9
gd32vw553h_start.pid.0=0x018A

gd32vw553h_start.build.mcu=gd32vw55x
gd32vw553h_start.build.f_cpu=160000000L
gd32vw553h_start.build.board=GD32VW553H_START
gd32vw553h_start.build.core=arduino
gd32vw553h_start.build.variant=gd32vw553h_start
gd32vw553h_start.build.system.path=system/gd32vw55x
gd32vw553h_start.build.extra_flags=-DGD32VW553H_START -DBOARD_START -DUSE_STDPERIPH_DRIVER
gd32vw553h_start.build.ldscript=ldscript.ld
gd32vw553h_start.upload.tool=openocd
gd32vw553h_start.upload.maximum_size=4194304
gd32vw553h_start.upload.maximum_data_size=294912

# Flash menu for H-START
gd32vw553h_start.menu.flash.4m.build.extra_flags=-DFLASH_4M
gd32vw553h_start.menu.flash.4m.build.ldscript=ldscript.ld
gd32vw553h_start.menu.flash.4m.upload.maximum_size=4194304

gd32vw553h_start.menu.flash.2m.build.extra_flags=-DFLASH_2M
gd32vw553h_start.menu.flash.2m.build.ldscript=ldscript_2m.ld
gd32vw553h_start.menu.flash.2m.upload.maximum_size=2097152
